Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པ་ལ་འཇུག་ཅིང་། ཉི་ཚེ་བའི་ཐེག་པས་ངེས་པར་འབྱུང་བར་མི་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་དེ་གང་ལགས།
en: In what circumstances do great bodhisattva beings enter into the maturity of the bodhisattvas, and what is this vehicle of the bodhisattvas wherein emancipation is not attained through limited vehicles?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། ཉི་ཚེ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་སྦྱིན་པ་སྦྱིན་པར་མི་བྱེད།
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, whenever great bodhisattva beings practice the transcendent perfection of generosity, they do not practice their generosity for the sake of a limited number of sentient beings.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན་ཉི་ཚེ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་ཚུལ་ཁྲིམས་མི་སྲུང་།
en: When they practice the transcendent perfection of ethical discipline, they do not maintain their ethical discipline for the sake of a limited number of sentient beings.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དེ་བཞིན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཉི་ཚེ་བའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་ཤེས་རབ་མི་སྒོམ་གྱི།
en: It is the same when they practice the transcendent perfection of tolerance, the transcendent perfection of perseverance, and the transcendent perfection of meditative concentration; and when they practice the transcendent perfection of wisdom, they do not cultivate wisdom for the sake of a limited number of sentient beings.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་ནས། དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ལ་སྤྱོད་པ་ན།
en: Rather, when they practice the transcendent perfection of generosity, they practice their generosity for the sake of all sentient beings, and so on in the same vein.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་ཤེས་རབ་སྒོམ་པར་བྱེད་དེ།
en: When they practice the transcendent perfection of wisdom, they cultivate wisdom for the sake of all sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ། །སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་མི་བྱའོ། །སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་དགོད་པར་བྱའོ། །སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་དགོད་པར་མི་བྱའོ། །
en: “Great bodhisattva beings do not don the great armor for the sake of a limited number of sentient beings, thinking, ‘So many sentient beings will I lead to final nirvāṇa in the expanse of non-residual nirvāṇa, and so many sentient beings will I not lead to final nirvāṇa; so many sentient beings will I establish in enlightenment, and so many sentient beings will I not establish [in enlightenment].’

source: སྙམ་དུ་སེམས་ཅན་རིས་སུ་ཆད་པ་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར། གོ་ཆ་ཆེན་པོ་གྱོན་པར་མི་བྱེད་ཀྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་གོ་ཆ་ཆེན་པོ་གྱོན་པར་བྱེད་ཅིང་། དེ་འདི་སྙམ་དུ་ཡང་སེམས་ཏེ། བདག་ཉིད་ཀྱིས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: Rather, they don the great armor for the sake of all sentient beings, thinking, ‘I myself should complete the transcendent perfection of generosity.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱར་བར་བྱའོ། །
en: I should also connect all sentient beings with the transcendent perfection of generosity.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། བདག་ཉིད་ཀྱིས་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །དེ་བཞིན་དུ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: In the same vein, I myself should complete the transcendent perfection of ethical discipline, and the same goes for the transcendent perfection of tolerance, the transcendent perfection of perseverance, and the transcendent perfection of meditative concentration.

source: བདག་ཉིད་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ལ་སྦྱར་བར་བྱའོ་སྙམ་པ་སྟེ།
en: I myself should complete the transcendent perfection of wisdom, and I should also connect all sentient beings with the transcendent perfection of wisdom.’

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཙམ་གྱིས་ན་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, it is to that extent that great bodhisattva beings are said to don the great armor.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། སྦྱིན་པ་གང་སྦྱིན་པ་དེ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་སྦྱིན་ཞིང་། དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ལྷན་ཅིག་ཐུན་མོང་དུ་བྱས་ནས། མི་དམིགས་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་འདི་ནི།
en: “Moreover, Śāradvatī­putra, with regard to great bodhisattva beings who practice the transcendent perfection of wisdom, all the acts of generosity that they make are offered with an omniscient mind, and, making common cause with all sentient beings, they dedicate these [acts] for the sake of unsurpassed, genuinely perfect enlightenment, without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་འོ། །
en: This, Śāradvatī­putra, is the armor of the transcendent perfection of generosity, possessed by great bodhisattva beings who practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་ཞིང་། དེ་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཡིད་ལ་མི་བྱེད་པར་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings offer their generosity, they do so with an omniscient mind, and dedicate this for the sake of all sentient beings in common, without being fascinated by the levels of the śrāvakas and pratyekabuddhas.

source: ཡོངས་སུ་སྔོ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པ་སྦྱིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་ཞེས་བྱའོ། །
en: This, Śāradvatī­putra, is called the armor of the transcendent perfection of ethical discipline, offered by great bodhisattva beings who practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བདག་གིས་སྦྱིན་ཞིང་། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱེད་ལ། ཆོས་དེ་དག་ལ་བཟོད་པ་དང་། འདོད་པ་དང་།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice their generosity, they do so attentive to the omniscient mind, and for the sake of all sentient beings in common, they exhibit endurance, satisfaction, and confidence with respect to [all] phenomena.

source: ཡིད་ཆེས་པ་འདི་དག་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆ་ཞེས་བྱའོ། །ཞེས་བྱ་བའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: These [attributes] are called the armor of the transcendent perfection of tolerance.

source: དེ་བཞིན་དུ་སྦྱིན་པ་སྦྱིན་པའི་བར་གྱི་བརྩོན་འགྲུས་ཀྱི་བརྩོན་པ་མི་གཏོང་ཞིང་མི་འདོར་ལ། རབ་ཏུ་འཛིན་པ་འདི་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆའོ། །
en: Similarly, the indefatigability, relentlessness, and tenacity with which they persevere while practicing their generosity and so forth, are called the armor of the transcendent perfection of perseverance.

source: དེ་བཞིན་དུ་སྦྱིན་པ་སྦྱིན་པ་ན། སེམས་ཅན་ཐམས་ཅད་ཡིད་ལ་བྱས་ནས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་ཀྱི་གོ་སྐབས་མི་འབྱེད་པར་འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་རྩེ་གཅིག་པ་ཉིད་འདི་ནི། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆའོ། །
en: Likewise, the one-pointedness of their minds in omniscience when they practice their generosity, attentive to all sentient beings, without permitting the mindsets of the śrāvakas and pratyekabuddhas to arise, is the armor of the transcendent perfection of meditative concentration.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་སྦྱིན་པ་ན། སྒྱུ་མའི་རྣམ་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཤིང་། དེས་སྦྱིན་པར་བྱེད་པ་ཡང་མི་དམིགས། སྦྱིན་པ་ཡང་མ་ཡིན། ལེན་པར་བྱེད་པ་ཡང་མ་ཡིན་ལ། སྦྱིན་པ་ཡང་སྦྱིན་པར་བྱེད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྦྱིན་པ་སྦྱིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གོ་ཆའོ། །
en: Moreover, Śāradvatī­putra, when great bodhisattva beings practice generosity, focusing on the notion that senses are illusory, and grant their gifts without apprehending the giver, the gift, and the recipient, this is the armor of the transcendent perfection of wisdom offered by great bodhisattva beings who practice the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གི་ཚེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་ལ་མཚན་མར་མི་བྱེད་ཅིང་དམིགས་པར་ཡང་མི་བྱེད་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །
en: “Śāradvatī­putra, whenever great bodhisattva beings with an omniscient mind neither conceptualize these six transcendent perfections nor apprehend them, these great bodhisattva beings are said to don the great armor.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ཅིང་། དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of ethical discipline, they grant their generosity with a mind endowed with omniscience, and dedicate this for the sake of unsurpassed, genuinely perfect enlightenment, making common cause with all sentient beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the transcendent perfection of generosity of great bodhisattva beings who practice the transcendent perfection of ethical discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཉན་ཐོས་དང་།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of ethical discipline, they do not hanker for the levels of the śrāvakas and pratyekabuddhas, and much less still for the levels of ordinary people.

source: རང་སངས་རྒྱས་ཀྱི་ས་ལ་ཡང་འདོད་པ་མེད་པ་ཉིད་ཡིན་ན་སོ་སོའི་སྐྱེ་བོའི་ས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the transcendent perfection of ethical discipline possessed by great bodhisattva beings.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཆོས་དེ་དག་ལ། བཟོད་པ་དང་། འདོད་པ་དང་། མངོན་པར་ཡིད་ཆེས་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of ethical discipline exhibit endurance, satisfaction, and confidence with respect to [all] phenomena, this is the transcendent perfection of tolerance, possessed by great bodhisattva beings who practice the transcendent perfection of ethical discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཆོས་དེ་དག་ལ་བརྩོན་པ་མི་གཏོང་ཞིང་མི་འདོར་བ་དང་། རབ་ཏུ་འཛིན་པ་གང་ཡིན་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of ethical discipline exhibit indefatigability, relentlessness, and tenacity with respect to [all] phenomena, this is the transcendent perfection of perseverance, possessed by great bodhisattva beings who practice the transcendent perfection of ethical discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དག་གིས་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བའི་སེམས་དང་མ་བྲལ་བར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་གོ་སྐབས་ཀྱང་མི་འབྱེད་ན། སོ་སོའི་སྐྱེ་བོའི་སེམས་དག་གིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of ethical discipline are not separated from thoughts preceded by great compassion, owing to their attentiveness endowed with omniscience, and do not permit the mindsets of the śrāvakas and pratyekabuddhas to arise, less still the mindsets of ordinary people, this is the transcendent perfection of meditative concentration, possessed by great bodhisattva beings who practice the transcendent perfection of ethical discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་གང་ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མའི་རྣམ་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཤིང་། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཚུལ་ཁྲིམས་དེ་ལ་ཡང་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་མི་དམིགས་པ་འདི་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Moreover, Śāradvatī­putra, whenever great bodhisattva beings who practice the transcendent perfection of ethical discipline focus on the notion that all phenomena are illusory, and when, owing to the emptiness of inherent existence, they neither make assumptions about nor apprehend ethical discipline, this is the transcendent perfection of wisdom possessed by great bodhisattva beings who practice the transcendent perfection of ethical discipline.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གིས་ཡོངས་སུ་ཟིན་པའི་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, so it is that when great bodhisattva beings practice the transcendent perfection of ethical discipline they are said to don the great armor that is retained by means of all six transcendent perfections.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱིས་སྦྱིན་པ་སྦྱིན་ཞིང་། དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་སྟེ། སྔ་མ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of tolerance, they practice their generosity with a mind endowed with omniscience and dedicate this for the sake of unsurpassed, genuinely perfect enlightenment, making common cause with all sentient beings, and so on in the same vein as before.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: “Also, the same goes for the transcendent perfection of perseverance, just as has been indicated in the context of the transcendent perfection of generosity.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་ཡང་སྙོམས་པར་འཇུག་ལ། དེ་དག་གི་དབང་གིས་ཀྱང་མི་སྐྱེ་ཞིང་མི་འཕྲོགས་པ་འདི་ནི།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of meditative concentration they become absorbed in the meditative concentrations, the immeasurable aspirations, and the formless absorptions, but they will not be reborn and they will not be captivated on account of these [absorptions].

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པ་དང་ལྡན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is the transcendent perfection of wisdom possessed by great bodhisattva beings, skillful in practicing the transcendent perfection of meditative concentration.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་ཡང་སྙོམས་པར་འཇུག་ཅིང་དབེན་པར་མཐོང་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པར་མཐོང་བས་ཉན་ཐོས་ཀྱིས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ཡང་འཇུག་ལ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་གནོན་པ་འདི་ཡང་།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of meditative concentration they become absorbed in the meditative concentrations, the immeasurable aspirations, and the formless absorptions, and then, through their vision of freedom and their vision of emptiness, signlessness, and aspirationlessness, they may indeed enter into the levels of the śrāvakas or pratyekabuddhas, whereupon all śrāvakas and pratyekabuddhas will be overwhelmed.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་ལ་མཁས་པ་དང་ལྡན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This, Śāradvatī­putra, is the transcendent perfection of wisdom possessed by great bodhisattva beings, skillful in practicing the transcendent perfection of meditative concentration.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་གོ་ཆ་ཆེན་པོ་བགོས་པ་ལ་ནི།
en: Śāradvatī­putra, it is in this way that great bodhisattva beings are said to don the great armor.

source: ཤར་ཕྱོགས་ནས་ཕྱོགས་མཚམས་ཀྱི་བར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་སུ་དག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་ག་གེ་མོ་ཞིག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་གོ་ཆ་ཆེན་པོ་བགོས་ཏེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད། རྫུ་འཕྲུལ་གྱིས་ཀྱང་རྣམ་པར་འཕྲུལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་པར་མཛད་ཅིང་། སྙན་པ་སྒྲོགས་ལ་དབྱངས་བརྗོད་པར་མཛད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Śāradvatī­putra, when great bodhisattva beings don the great armor in these ways, then, throughout the world systems, from the eastern direction up to the intermediate directions, numerous as the sands of the River Ganges, all the lord buddhas who reside therein will purposefully declare and incant in their eulogies, ‘This great bodhisattva being, in such and such a world system, has donned the great armor, is bringing sentient beings to maturity, is refining the buddhafields, and is even conjuring emanational forms through miraculous abilities!’” Then, the venerable Śāradvatī­putra asked the Blessed One as follows: “Reverend Lord!

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་གང་གིས་དེ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞོན་པ་ཞེས་བགྱི་བ་དེ་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: By means of what is it said that great bodhisattva beings who have entered upon the Great Vehicle, ride upon the Great Vehicle?”

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ན། འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ།
en: The Blessed One then addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, when great bodhisattva beings practice the six transcendent perfections, they achieve and then maintain the first meditative concentration, where there is freedom from the passions [of the senses], and freedom from negative and non-virtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom.

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་པ་དང་། དེ་རྟོག་པ་དང་། དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ།
en: They then achieve and maintain the second meditative concentration, where there is an intense inner clarity, free from both ideation and scrutiny—the absence of ideation and scrutiny being due to one-pointed mental focus, while the joy and bliss that arise from meditative stability are present.

source: དཔྱོད་པ་མེད་པ་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ་གནས་པ་དང་། དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་བཏང་སྙོམས་པ་དྲན་པ་ཡོངས་སུ་དག་པའོ། །ཞེས་བརྗོད་པ་དག་སྟེ། དགའ་བ་མེད་པ་བདེ་བ་ལ་གནས་པ་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་པ་དང་།
en: They then achieve and maintain the third meditative concentration, where bliss remains but joy is absent due to the absence of attachment to joy—this is what sublime beings describe as ‘equanimous, mindful, and pure’.

source: དེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་སྡུག་བསྔལ་ཡང་མ་ཡིན། བདེ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ། བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་པ་དང་།
en: And they then achieve and maintain the fourth meditative concentration where even that sense of bliss is abandoned, and neither suffering nor bliss is present because blissful and unhappy states of mind have both previously subsided, while equanimity and mindfulness are utterly pure.

source: དེ་བཞིན་དུ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ། མི་གཉིས་པ། ཚད་མེད་པ། ཁོ་ན་མེད་པ། གནོད་པ་མེད་པ། འགྲན་ཟླ་མེད་པ། ཡོངས་སུ་རྫོགས་པ། ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཁྱབ་པར་བྱས་ཏེ། མོས་ནས་བསྒྲུབས་ཏེ་གནས་པ་དང་། དེ་བཞིན་དུ་གཉིས་པ་དང་།
en: “Similarly, they achieve and maintain the mind that is endowed with loving kindness, its volition permeating a single direction of space because it is vast, extensive, non-dual, immeasurable, free from enmity, free from harm, without rivalry, perfected, and well-cultivated.

source: དེ་བཞིན་དུ་གསུམ་པ་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཞི་པ་དང་། དེ་བཞིན་དུ་འོག་དང་། སྟེང་དང་། ཐད་ཀར་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་ལ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ། མོས་ནས་བསྒྲུབས་ཏེ་གནས་པ་དང་།
en: Likewise, they then achieve and maintain the mind endowed with loving kindness, the volition of which permeates a second [direction of space], and similarly, a third, a fourth, the nadir, the zenith, the horizon, and the entire universe.

source: དེ་བཞིན་དུ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་ཀྱིས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་ལ་ཁྱབ་པར་བྱས་ཏེ། མོས་པའི་བར་དུ་བསྒྲུབས་ནས་གནས་པ་སྟེ།
en: “In the same way, they then achieve and maintain the mind that is endowed with compassion, empathetic joy, and equanimity, its volition permeating the entire universe.

source: ཚད་མེད་པ་བཞི་བསམ་གཏན་དང་ལྡན་པ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་རབ་མཆོག་ཡིན་ནོ། །
en: These combined [practices] of the four immeasurable aspirations and the [four] meditative concentrations form the supremely excellent Great Vehicle of great bodhisattva beings.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་དེ་དག་ཉིད་ཚད་མེད་པའི་རྣམ་པ་དང་། རྟགས་དང་མཚན་མ་དག་གིས་སྙོམས་པར་འཇུག་ཅིང་ལྡང་བ་དེ་དག་སྙོམས་པར་འཇུག་ཅིང་ལྡང་བ་ན། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་འདི་ཡང་།
en: “When great bodhisattva beings are absorbed in these meditative concentrations, conjoined with the aspects of the immeasurable aspirations, replete with the [appropriate] signs and indications [of successful practice], and then arise [from these meditative states], making common cause with all sentient beings, they act so as to perfect omniscience.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ཡིན་ནོ། །
en: This indeed, Śāradvatī­putra, is the Great Vehicle of great bodhisattva beings.
